; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-3-31-29)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 room21 room22 room23 room24 room25 room26 room27 room28 room29 room30 room31 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 - object)
(:init
(at-robby robot1 room11)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room3)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room3)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at ball1 room29)
(at ball2 room8)
(at ball3 room19)
(at ball4 room14)
(at ball5 room15)
(at ball6 room6)
(at ball7 room4)
(at ball8 room3)
(at ball9 room31)
(at ball10 room2)
(at ball11 room6)
(at ball12 room17)
(at ball13 room25)
(at ball14 room27)
(at ball15 room23)
(at ball16 room12)
(at ball17 room6)
(at ball18 room31)
(at ball19 room20)
(at ball20 room7)
(at ball21 room31)
(at ball22 room29)
(at ball23 room1)
(at ball24 room22)
(at ball25 room21)
(at ball26 room9)
(at ball27 room18)
(at ball28 room3)
(at ball29 room20)
)
(:goal
(and
(at ball1 room20)
(at ball2 room5)
(at ball3 room18)
(at ball4 room28)
(at ball5 room24)
(at ball6 room1)
(at ball7 room12)
(at ball8 room29)
(at ball9 room4)
(at ball10 room14)
(at ball11 room28)
(at ball12 room6)
(at ball13 room20)
(at ball14 room13)
(at ball15 room31)
(at ball16 room15)
(at ball17 room4)
(at ball18 room11)
(at ball19 room21)
(at ball20 room3)
(at ball21 room31)
(at ball22 room27)
(at ball23 room3)
(at ball24 room28)
(at ball25 room28)
(at ball26 room25)
(at ball27 room18)
(at ball28 room6)
(at ball29 room11)
)
)
)

; plan
1. (pick robot2 ball8 room3 lgripper2)
   deleted: (at ball8 room3) (free robot2 lgripper2)
   added: (carry robot2 ball8 lgripper2)
   goals met: 2 of 29
2. (pick robot3 ball28 room3 lgripper3)
   deleted: (at ball28 room3) (free robot3 lgripper3)
   added: (carry robot3 ball28 lgripper3)
   goals met: 2 of 29
3. (move robot1 room11 room9)
   deleted: (at-robby robot1 room11)
   added: (at-robby robot1 room9)
   goals met: 2 of 29
4. (move robot3 room3 room6)
   deleted: (at-robby robot3 room3)
   added: (at-robby robot3 room6)
   goals met: 2 of 29
5. (move robot2 room3 room6)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room6)
   goals met: 2 of 29
6. (move robot1 room9 room8)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room8)
   goals met: 2 of 29
7. (drop robot3 ball28 room6 lgripper3)
   deleted: (carry robot3 ball28 lgripper3)
   added: (at ball28 room6) (free robot3 lgripper3)
   goals met: 3 of 29
8. (pick robot1 ball2 room8 lgripper1)
   deleted: (at ball2 room8) (free robot1 lgripper1)
   added: (carry robot1 ball2 lgripper1)
   goals met: 3 of 29
9. (move robot2 room6 room9)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room9)
   goals met: 3 of 29
10. (move robot1 room8 room5)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room5)
   goals met: 3 of 29
11. (move robot3 room6 room19)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room19)
   goals met: 3 of 29
12. (move robot2 room9 room29)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room29)
   goals met: 3 of 29
13. (drop robot1 ball2 room5 lgripper1)
   deleted: (carry robot1 ball2 lgripper1)
   added: (at ball2 room5) (free robot1 lgripper1)
   goals met: 4 of 29
14. (pick robot3 ball3 room19 lgripper3)
   deleted: (at ball3 room19) (free robot3 lgripper3)
   added: (carry robot3 ball3 lgripper3)
   goals met: 4 of 29
15. (drop robot2 ball8 room29 lgripper2)
   deleted: (carry robot2 ball8 lgripper2)
   added: (at ball8 room29) (free robot2 lgripper2)
   goals met: 5 of 29
16. (pick robot2 ball22 room29 rgripper2)
   deleted: (at ball22 room29) (free robot2 rgripper2)
   added: (carry robot2 ball22 rgripper2)
   goals met: 5 of 29
17. (move robot3 room19 room18)
   deleted: (at-robby robot3 room19)
   added: (at-robby robot3 room18)
   goals met: 5 of 29
18. (move robot2 room29 room27)
   deleted: (at-robby robot2 room29)
   added: (at-robby robot2 room27)
   goals met: 5 of 29
19. (move robot1 room5 room17)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room17)
   goals met: 5 of 29
20. (drop robot3 ball3 room18 lgripper3)
   deleted: (carry robot3 ball3 lgripper3)
   added: (at ball3 room18) (free robot3 lgripper3)
   goals met: 6 of 29
21. (drop robot2 ball22 room27 rgripper2)
   deleted: (carry robot2 ball22 rgripper2)
   added: (at ball22 room27) (free robot2 rgripper2)
   goals met: 7 of 29
22. (pick robot2 ball14 room27 lgripper2)
   deleted: (at ball14 room27) (free robot2 lgripper2)
   added: (carry robot2 ball14 lgripper2)
   goals met: 7 of 29
23. (pick robot1 ball12 room17 lgripper1)
   deleted: (at ball12 room17) (free robot1 lgripper1)
   added: (carry robot1 ball12 lgripper1)
   goals met: 7 of 29
24. (move robot2 room27 room13)
   deleted: (at-robby robot2 room27)
   added: (at-robby robot2 room13)
   goals met: 7 of 29
25. (move robot1 room17 room6)
   deleted: (at-robby robot1 room17)
   added: (at-robby robot1 room6)
   goals met: 7 of 29
26. (move robot3 room18 room9)
   deleted: (at-robby robot3 room18)
   added: (at-robby robot3 room9)
   goals met: 7 of 29
27. (drop robot2 ball14 room13 lgripper2)
   deleted: (carry robot2 ball14 lgripper2)
   added: (at ball14 room13) (free robot2 lgripper2)
   goals met: 8 of 29
28. (drop robot1 ball12 room6 lgripper1)
   deleted: (carry robot1 ball12 lgripper1)
   added: (at ball12 room6) (free robot1 lgripper1)
   goals met: 9 of 29
29. (pick robot1 ball6 room6 rgripper1)
   deleted: (at ball6 room6) (free robot1 rgripper1)
   added: (carry robot1 ball6 rgripper1)
   goals met: 9 of 29
30. (pick robot3 ball26 room9 lgripper3)
   deleted: (at ball26 room9) (free robot3 lgripper3)
   added: (carry robot3 ball26 lgripper3)
   goals met: 9 of 29
31. (move robot2 room13 room7)
   deleted: (at-robby robot2 room13)
   added: (at-robby robot2 room7)
   goals met: 9 of 29
32. (move robot3 room9 room25)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room25)
   goals met: 9 of 29
33. (move robot1 room6 room25)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room25)
   goals met: 9 of 29
34. (drop robot3 ball26 room25 lgripper3)
   deleted: (carry robot3 ball26 lgripper3)
   added: (at ball26 room25) (free robot3 lgripper3)
   goals met: 10 of 29
35. (pick robot2 ball20 room7 lgripper2)
   deleted: (at ball20 room7) (free robot2 lgripper2)
   added: (carry robot2 ball20 lgripper2)
   goals met: 10 of 29
36. (move robot1 room25 room1)
   deleted: (at-robby robot1 room25)
   added: (at-robby robot1 room1)
   goals met: 10 of 29
37. (pick robot3 ball13 room25 rgripper3)
   deleted: (at ball13 room25) (free robot3 rgripper3)
   added: (carry robot3 ball13 rgripper3)
   goals met: 10 of 29
38. (move robot2 room7 room3)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room3)
   goals met: 10 of 29
39. (drop robot1 ball6 room1 rgripper1)
   deleted: (carry robot1 ball6 rgripper1)
   added: (at ball6 room1) (free robot1 rgripper1)
   goals met: 11 of 29
40. (pick robot1 ball23 room1 lgripper1)
   deleted: (at ball23 room1) (free robot1 lgripper1)
   added: (carry robot1 ball23 lgripper1)
   goals met: 11 of 29
41. (move robot3 room25 room6)
   deleted: (at-robby robot3 room25)
   added: (at-robby robot3 room6)
   goals met: 11 of 29
42. (move robot1 room1 room3)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room3)
   goals met: 11 of 29
43. (drop robot2 ball20 room3 lgripper2)
   deleted: (carry robot2 ball20 lgripper2)
   added: (at ball20 room3) (free robot2 lgripper2)
   goals met: 12 of 29
44. (move robot3 room6 room20)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room20)
   goals met: 12 of 29
45. (drop robot1 ball23 room3 lgripper1)
   deleted: (carry robot1 ball23 lgripper1)
   added: (at ball23 room3) (free robot1 lgripper1)
   goals met: 13 of 29
46. (move robot2 room3 room4)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room4)
   goals met: 13 of 29
47. (drop robot3 ball13 room20 rgripper3)
   deleted: (carry robot3 ball13 rgripper3)
   added: (at ball13 room20) (free robot3 rgripper3)
   goals met: 14 of 29
48. (pick robot3 ball29 room20 lgripper3)
   deleted: (at ball29 room20) (free robot3 lgripper3)
   added: (carry robot3 ball29 lgripper3)
   goals met: 14 of 29
49. (pick robot2 ball7 room4 lgripper2)
   deleted: (at ball7 room4) (free robot2 lgripper2)
   added: (carry robot2 ball7 lgripper2)
   goals met: 14 of 29
50. (move robot3 room20 room14)
   deleted: (at-robby robot3 room20)
   added: (at-robby robot3 room14)
   goals met: 14 of 29
51. (move robot1 room3 room15)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room15)
   goals met: 14 of 29
52. (move robot2 room4 room12)
   deleted: (at-robby robot2 room4)
   added: (at-robby robot2 room12)
   goals met: 14 of 29
53. (pick robot1 ball5 room15 lgripper1)
   deleted: (at ball5 room15) (free robot1 lgripper1)
   added: (carry robot1 ball5 lgripper1)
   goals met: 14 of 29
54. (pick robot3 ball4 room14 rgripper3)
   deleted: (at ball4 room14) (free robot3 rgripper3)
   added: (carry robot3 ball4 rgripper3)
   goals met: 14 of 29
55. (drop robot2 ball7 room12 lgripper2)
   deleted: (carry robot2 ball7 lgripper2)
   added: (at ball7 room12) (free robot2 lgripper2)
   goals met: 15 of 29
56. (move robot1 room15 room24)
   deleted: (at-robby robot1 room15)
   added: (at-robby robot1 room24)
   goals met: 15 of 29
57. (pick robot2 ball16 room12 rgripper2)
   deleted: (at ball16 room12) (free robot2 rgripper2)
   added: (carry robot2 ball16 rgripper2)
   goals met: 15 of 29
58. (move robot3 room14 room11)
   deleted: (at-robby robot3 room14)
   added: (at-robby robot3 room11)
   goals met: 15 of 29
59. (move robot2 room12 room15)
   deleted: (at-robby robot2 room12)
   added: (at-robby robot2 room15)
   goals met: 15 of 29
60. (drop robot1 ball5 room24 lgripper1)
   deleted: (carry robot1 ball5 lgripper1)
   added: (at ball5 room24) (free robot1 lgripper1)
   goals met: 16 of 29
61. (drop robot3 ball29 room11 lgripper3)
   deleted: (carry robot3 ball29 lgripper3)
   added: (at ball29 room11) (free robot3 lgripper3)
   goals met: 17 of 29
62. (drop robot2 ball16 room15 rgripper2)
   deleted: (carry robot2 ball16 rgripper2)
   added: (at ball16 room15) (free robot2 rgripper2)
   goals met: 18 of 29
63. (move robot3 room11 room31)
   deleted: (at-robby robot3 room11)
   added: (at-robby robot3 room31)
   goals met: 18 of 29
64. (move robot1 room24 room4)
   deleted: (at-robby robot1 room24)
   added: (at-robby robot1 room4)
   goals met: 18 of 29
65. (move robot2 room15 room2)
   deleted: (at-robby robot2 room15)
   added: (at-robby robot2 room2)
   goals met: 18 of 29
66. (pick robot3 ball18 room31 lgripper3)
   deleted: (at ball18 room31) (free robot3 lgripper3)
   added: (carry robot3 ball18 lgripper3)
   goals met: 18 of 29
67. (move robot1 room4 room6)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room6)
   goals met: 18 of 29
68. (pick robot2 ball10 room2 lgripper2)
   deleted: (at ball10 room2) (free robot2 lgripper2)
   added: (carry robot2 ball10 lgripper2)
   goals met: 18 of 29
69. (move robot3 room31 room28)
   deleted: (at-robby robot3 room31)
   added: (at-robby robot3 room28)
   goals met: 18 of 29
70. (pick robot1 ball17 room6 lgripper1)
   deleted: (at ball17 room6) (free robot1 lgripper1)
   added: (carry robot1 ball17 lgripper1)
   goals met: 18 of 29
71. (pick robot1 ball11 room6 rgripper1)
   deleted: (at ball11 room6) (free robot1 rgripper1)
   added: (carry robot1 ball11 rgripper1)
   goals met: 18 of 29
72. (move robot2 room2 room14)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room14)
   goals met: 18 of 29
73. (drop robot3 ball4 room28 rgripper3)
   deleted: (carry robot3 ball4 rgripper3)
   added: (at ball4 room28) (free robot3 rgripper3)
   goals met: 19 of 29
74. (move robot1 room6 room4)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room4)
   goals met: 19 of 29
75. (drop robot2 ball10 room14 lgripper2)
   deleted: (carry robot2 ball10 lgripper2)
   added: (at ball10 room14) (free robot2 lgripper2)
   goals met: 20 of 29
76. (move robot3 room28 room11)
   deleted: (at-robby robot3 room28)
   added: (at-robby robot3 room11)
   goals met: 20 of 29
77. (drop robot1 ball17 room4 lgripper1)
   deleted: (carry robot1 ball17 lgripper1)
   added: (at ball17 room4) (free robot1 lgripper1)
   goals met: 21 of 29
78. (drop robot3 ball18 room11 lgripper3)
   deleted: (carry robot3 ball18 lgripper3)
   added: (at ball18 room11) (free robot3 lgripper3)
   goals met: 22 of 29
79. (move robot2 room14 room4)
   deleted: (at-robby robot2 room14)
   added: (at-robby robot2 room4)
   goals met: 22 of 29
80. (move robot1 room4 room31)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room31)
   goals met: 22 of 29
81. (move robot3 room11 room29)
   deleted: (at-robby robot3 room11)
   added: (at-robby robot3 room29)
   goals met: 22 of 29
82. (move robot1 room31 room28)
   deleted: (at-robby robot1 room31)
   added: (at-robby robot1 room28)
   goals met: 22 of 29
83. (move robot2 room4 room31)
   deleted: (at-robby robot2 room4)
   added: (at-robby robot2 room31)
   goals met: 22 of 29
84. (pick robot3 ball1 room29 lgripper3)
   deleted: (at ball1 room29) (free robot3 lgripper3)
   added: (carry robot3 ball1 lgripper3)
   goals met: 22 of 29
85. (drop robot1 ball11 room28 rgripper1)
   deleted: (carry robot1 ball11 rgripper1)
   added: (at ball11 room28) (free robot1 rgripper1)
   goals met: 23 of 29
86. (pick robot2 ball9 room31 lgripper2)
   deleted: (at ball9 room31) (free robot2 lgripper2)
   added: (carry robot2 ball9 lgripper2)
   goals met: 23 of 29
87. (move robot3 room29 room20)
   deleted: (at-robby robot3 room29)
   added: (at-robby robot3 room20)
   goals met: 23 of 29
88. (move robot2 room31 room4)
   deleted: (at-robby robot2 room31)
   added: (at-robby robot2 room4)
   goals met: 23 of 29
89. (move robot1 room28 room23)
   deleted: (at-robby robot1 room28)
   added: (at-robby robot1 room23)
   goals met: 23 of 29
90. (drop robot3 ball1 room20 lgripper3)
   deleted: (carry robot3 ball1 lgripper3)
   added: (at ball1 room20) (free robot3 lgripper3)
   goals met: 24 of 29
91. (drop robot2 ball9 room4 lgripper2)
   deleted: (carry robot2 ball9 lgripper2)
   added: (at ball9 room4) (free robot2 lgripper2)
   goals met: 25 of 29
92. (pick robot3 ball19 room20 rgripper3)
   deleted: (at ball19 room20) (free robot3 rgripper3)
   added: (carry robot3 ball19 rgripper3)
   goals met: 25 of 29
93. (pick robot1 ball15 room23 lgripper1)
   deleted: (at ball15 room23) (free robot1 lgripper1)
   added: (carry robot1 ball15 lgripper1)
   goals met: 25 of 29
94. (move robot1 room23 room31)
   deleted: (at-robby robot1 room23)
   added: (at-robby robot1 room31)
   goals met: 25 of 29
95. (move robot3 room20 room22)
   deleted: (at-robby robot3 room20)
   added: (at-robby robot3 room22)
   goals met: 25 of 29
96. (move robot2 room4 room28)
   deleted: (at-robby robot2 room4)
   added: (at-robby robot2 room28)
   goals met: 25 of 29
97. (drop robot1 ball15 room31 lgripper1)
   deleted: (carry robot1 ball15 lgripper1)
   added: (at ball15 room31) (free robot1 lgripper1)
   goals met: 26 of 29
98. (pick robot3 ball24 room22 lgripper3)
   deleted: (at ball24 room22) (free robot3 lgripper3)
   added: (carry robot3 ball24 lgripper3)
   goals met: 26 of 29
99. (move robot2 room28 room21)
   deleted: (at-robby robot2 room28)
   added: (at-robby robot2 room21)
   goals met: 26 of 29
100. (move robot3 room22 room28)
   deleted: (at-robby robot3 room22)
   added: (at-robby robot3 room28)
   goals met: 26 of 29
101. (pick robot2 ball25 room21 lgripper2)
   deleted: (at ball25 room21) (free robot2 lgripper2)
   added: (carry robot2 ball25 lgripper2)
   goals met: 26 of 29
102. (drop robot3 ball24 room28 lgripper3)
   deleted: (carry robot3 ball24 lgripper3)
   added: (at ball24 room28) (free robot3 lgripper3)
   goals met: 27 of 29
103. (move robot2 room21 room28)
   deleted: (at-robby robot2 room21)
   added: (at-robby robot2 room28)
   goals met: 27 of 29
104. (move robot3 room28 room21)
   deleted: (at-robby robot3 room28)
   added: (at-robby robot3 room21)
   goals met: 27 of 29
105. (drop robot2 ball25 room28 lgripper2)
   deleted: (carry robot2 ball25 lgripper2)
   added: (at ball25 room28) (free robot2 lgripper2)
   goals met: 28 of 29
106. (drop robot3 ball19 room21 rgripper3)
   deleted: (carry robot3 ball19 rgripper3)
   added: (at ball19 room21) (free robot3 rgripper3)
   goals met: 29 of 29
